---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamTypeDumped
source: html/ac584447-54b9-41b0-354d-6f36013046d1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamTypeDumped Property

Can't make type "[Family Name]". It will be deleted. Failing family has been saved to "[File Name]"

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletingBadFamTypeDumped { get; }
```